<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5ffb36eab9c4a81f96e7be3557d0ef56c7799107dc9b13ce8ed412dc95f6b459","plan_job_ref":"Job .github/workflows/_test-tf.yaml #191 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11361134487","plan_out_hash":"2dbc6ecdc59e640674ecb15a83e434d6ec234e9774dc2b12b4fa448869f86891","plan_hash":"180a7587238c7d18e688682c49fd028a186a1e1a4c0ac41d72e293d855733a93","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #191](https://github.com/tx-pts-dai/github-workflows/actions/runs/11361134487)